"Bass Frequency" = "Bassotaajuus"; 
"Bass Gain" = "Bassovahvistus"; 
"Low Mid Frequency" = "Alakeskitaajuus";
"Low Mid Gain" = "Alakeskivahvistus";
"High Mid Frequency" = "Yläkeskitaajuus";
"High Mid Gain" = "Yläkeskivahvistus";
"Treble Frequency" = "Diskanttitaajuus";
"Treble Gain" = "Diskanttivahvistus";
